//класс это блок объединения объектов функций и циклов

//Class extends Class 

//создать отношения между классами. т.е родитель и ребенок

//super.name 

// обратиться к родителю

//





// работа с this если потерялся контекст

// call  принимает через запятую
 
// apply  принимает в виде массива

// bind привязывает контекст



//работа со строками стр  54 

string[3] вывод определенной буквы индекс пишем

string.slice(2,6) вырезать буквы в приеоде индексов т.е 3 буква - 5 буква. если написано отрицательное6 число то будеть считать с конца

string.replace('l','L') поменять букву. т.е. пишем какую букву, второе пишем на какую меняем

string.replaceAll('l', 'LLL') меняет букву которую мы указали первой, на написанное после заппятой. и меняет все буквы эти в предложении или слове

string.startsWith('Hel') возвращает true false если начинается слово с этого

string.endsWith('ld') возвращает true false если заканчивается слово с этого

string.includes('hel') возвращает t/f если есть или нет подстрока в строке


удаляют ненужные пробелы. особенно нужно для валидации
string.trim()

string.trimStart()

string.trimEnd()


string.split(' ') разделяет слово. если будет написано '' то разделит каждую букву отдельно. если ' ' то разделит все пробелы на строки

string.lenght

string.toLowerCase() сделать все буквы маленькими
 
string.toUpperCase() сделать все буквы большими

('!'.repeat(10)) повторить первое столько раз как написано второй позицуиии


string.match() находит есть соответствие сочетания букв, буквы символы в выржаении. 

Пример (/.*/) означает любой символ. 

(/.*lo.*/) означает любой символ перед и после сочетания букв 'lo'

\s* - почитать что значит



////!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//регулярные выражения изучить на сайте regex101






