typeof //выводит тип переменной или элемента

instanceof //проверяет входит ли этот элемент в определнной цепочке объектов

try / catch //используется если произошла ошибка, то в try пишется код ,а если будет ошибка, то сработает код из catch и код пойдет дальше. \
throw //можно еще в конце добавить , который останавливает последующий код
finally//можно добавить в конец. если мы останавливаем блок работ, но файналли отработает в любом случае




/////closure замыкание//////
//нужно для того чтобы функция оставляла перемнную активной и ей можно было пользоваться. т.к. функция после использования просто удаляетп еременные



