Math.abs()

Math.pow(2,5)//вовзводит 1 аргумент в стпень 2 аргумента. идиентично 2 ** 5

Math.sqrt()//корень квадратный из любого числа

Math.random()

Math.ceil(a)//возможность округления. Округляет до ближайшего большего целого
Math.floor(a)//возможность округления. Окргуляет до ближайшего меньше целого числа
Math.round(a)//возможность округления. Округляет до ближайшего целого числа по правилам математики
Math.trunc(a)//возможность округления. Отрезает дробную часть

Number.toFixed(2)//оставляет 2 знака после запятой





